Repository: 84000/data-translation-memory
Catalog: toh190-v3.tmx
Source language: bo
Languages: en

source: ཉོན་མོངས་པ་མེད་པ་མཉམ་པ་ཉིད་ཀྱིས་ཀྱང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་མཉམ་པ་ཉིད་དུ་ཡོངས་སུ་མཁྱེན་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཀྱང་མ་འདས་ལ་འཕགས་པའི་ས་ལ་ཡང་མ་ཞུགས་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་སྣང་བ་ཡང་མ་ལགས།
en: If honorable Subhūti has, by means of the sameness of the noble ones, realized the sameness of ordinary beings, then, in that case, partake of these alms. Honorable Subhūti, if you yourself neither go out of existence from this world nor take birth in the next, then, in that case, partake of these alms. If honorable Subhūti has realized the sameness of the absence of afflictions by means of the sameness of passion, aggression, and delusion, and has also realized the sameness of passion, aggression, and delusion by means of the sameness of the absence of afflictions, then, in that case, partake of these alms. If honorable Subhūti has not transcended the level of ordinary beings, nor entered the level of noble ones, then, in that case, partake of these alms.

source: སྣང་བར་འགྲོ་བ་ཡང་མ་ལགས། འཁོར་བ་ལ་ཡང་མ་ཞུགས། མྱ་ངན་ལས་འདས་པ་ཡང་མི་འཐོབ། བརྫུན་དུ་སྨྲ་བ་ཡང་མ་ལགས། བདེན་པར་སྨྲ་བ་ཡང་མ་ལགས་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་གྱིས་ཟག་པ་ཡང་ཟད་པར་མི་མཛད་ལ་མི་ཟད་པ་ཡང་འཁྲུག་པར་མི་མཛད།
en: If honorable Subhūti neither appears nor is going to appear, has neither entered saṃsāra nor attained nirvāṇa, and is one who speaks neither falsely nor truly, then, in that case, partake of these alms. “If honorable Subhūti has neither brought defilements to their extinction nor stirred up what is not extinguished;

source: ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ལས་ཀྱང་མི་གཡོ་ལ་རྟེན་པ་མ་མཆིས་པར་ཡང་ཉོན་མོངས་པ་མ་མཆིས་པ་བསམ་གཏན་དུ་མཛད།
en: if he engages in concentration free from afflictions with neither wavering from the aggregates, elements, and sense sources, nor indulging in them;

source: ཐམས་ཅད་ལ་ཡང་རྟག་ཏུ་སྨོན་པ་མི་མངའ་ལ་ཆོས་རྣམས་ཀྱང་སེམས་ཀྱིས་ཤིན་ཏུ་ཐུགས་སུ་ཆུད་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་ཁྱོད་ཀྱིས་གང་གི་ཕྱིར་རབ་ཏུ་བྱུང་བའི་ཆོས་དེ་མ་རྟོགས་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །བཙུན་པ་རབ་འབྱོར་གྱི་ཉོན་མོངས་པ་མེད་པ་གང་ལགས་པ་དང་། སེམས་ཅན་དམྱལ་བ་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་མེད་པ་གང་ལགས་པ།
en: and if he does not ever have wishes with respect to anything at all, but has mentally gained understanding of phenomena, then, in that case, partake of these alms. Honorable Subhūti, if you have not realized the teaching of renunciates, then in that case, partake of these alms.

source: བཙུན་པ་རབ་འབྱོར་གལ་ཏེ་ཉོན་མོངས་པ་མེད་པ་འདི་གཉིས་ལ་ཡོན་གནས་ཆེས་ལྷག་པ་མ་མཆིས་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །འཕགས་པ་རབ་འབྱོར་ལ་ཡོན་གནས་ཡིན་པར་འདུ་ཤེས་སྐྱེད་པ་གང་ལགས་པ་དེ་དག་ནི་བཙུན་པ་རབ་འབྱོར་ལ་མེད་པ་དང་། ཡང་དག་པ་མ་ཡིན་པས་སྐུར་པ་འདེབས་པ་སྟེ།
en: Honorable Subhūti, if Subhūti’s absence of afflictions and that of hell-beings are both of the same worth, then, in that case, partake of these alms. One would deprecate the noble Subhūti by saying that whatever notions might be harbored about someone being worthy of offerings, none of them would pertain, or apply, to the honorable Subhūti. If, however, honorable Subhūti does have these qualities, then in that case, partake of these alms.”

source: གལ་ཏེ་བཙུན་པ་རབ་འབྱོར་ཁྱོད་ཆོས་དེ་ལྟ་བུ་དང་ལྡན་ན་དེ་ལྟ་ན་བསོད་སྙོམས་འདི་བཞེས་ཤིག །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་སྒོ་གང་དེ་གཡོས་པར་བྱས་ནས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཆེ་ཞེ་གང་དག་ཡང་དག་པར་སྨྲ་བ་ན་འདི་ལྟ་བུའི་ཆོས་ལྡན་པར་སྨྲ་བ་དེ་དག་ནི་བདག་ལ་ཡང་དག་པར་སྨྲ་བས་སྨྲ་བ་ཡིན་ནོ།
en: As Venerable Subhūti prepared to leave the gate, he raised his right hand and said, “Elder sister, those who speak truthfully will say that I possess such qualities.

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་བསོད་སྙོམས་དེ་བླངས་སོ།
en: In doing so, they describe me correctly.” Having said that, he took up the alms.

source: །དེ་ནས་བུད་མེད་དེས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Excellent,” said the lady to Venerable Subhūti, “Those beings who are worthy of offerings and who receive alms with sameness are indeed rare.”

source: །གང་དག་མཉམ་པ་ཉིད་ཀྱིས་བསོད་སྙོམས་ལེན་པའི་ཡོན་གནས་དེ་དག་ནི་དཀོན་ནོ།
en: Venerable Subhūti said, “Those with excessive pride repudiate and belittle the state of sameness. Doing so leads most of them to take birth in the hell realms.”

source: །སྨྲས་པ། མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ནི་མཉམ་པ་ཉིད་འདི་སུན་ཕྱུང་སྟེ་སྨད་ནས་ཕལ་ཆེར་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་རོ། །དེ་ནས་ལྷ་དེས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་ཁྱོད་ཀྱིས་ཅི་ལས་བསམས་ཏེ་གང་དག་ཆོས་འདི་སུན་ཕྱུང་སྟེ་སྨད་ནས་ཕལ་ཆེར་སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་རོ་ཞེས་དེ་སྐད་སྨྲ། སྨྲས་པ།
en: The god said to Venerable Subhūti, “What do you mean, honorable Subhūti, when you say that most of those who repudiate and belittle this Dharma take birth in the hell realms?”

source: ལྷ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Celestial being, consider this:

source: སྒྱུ་མའི་ཆོས་འགའ་ཞིག་ལ་འདི་ནི་རྒྱུ་དང་བཅས་པའོ། །འདི་ནི་རྒྱུ་མེད་པའོ་ཞེས་སུན་འབྱིན་པའམ། སྨོད་པར་བྱེད་དམ།
en: Is it repudiation or belittling to say that some illusory phenomenon has a cause or that it lacks a cause?”

source: སྨྲས་པ། བཙུན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: “No, it is not, honorable Subhūti.”

source: ལྷ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་རྟོགས་ན་བདག་གིས་སུན་དབྱུང་བའམ་སྨད་དུ་ཅི་ཞིག་ཡོད།
en: “Similarly, celestial being, when all phenomena have been understood to be like illusions, what is there for me to repudiate or belittle?

source: ལྷ་གཞན་ཡང་བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཡང་དག་པའམ། ཡང་དག་པ་མ་ཡིན་པ་བརྗོད་པའི་སྒྲ་དེ་དག་ཐམས་ཅད་དང་མཉམ་མོ།
en: Furthermore, celestial being, the sounds expressed by all beings, whether true or untrue, are all the same to me.

source: བརྗོད་པ་ཐམས་ཅད་ནི་སྒྱུ་མའི་ངོ་བོ་ཉིད་ཀྱིས་བརྗོད་དུ་མེད་དོ།
en: Because all expressions, due to their illusory essence, are actually non-expressions.”

source: །བསོད་སྙོམས་ལེན་པ་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་བརྒྱ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: When this teaching on receiving alms had been given, one hundred gods purified the faultless and stainless eye of Dharma that beholds phenomena.

source: །དེ་ནས་བུད་མེད་དེས་འཕགས་པ་རབ་འབྱོར་ལ་བཟོད་པ་གསོལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བཤོས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་བཞུད་ཅིག་དང་། བདག་ཀྱང་ཆོས་མཉན་པའི་སླད་དུ་དེར་མཆིའོ།
en: Then the lady excused herself, saying to noble Subhūti, “Honorable Subhūti, please have some food and then proceed to the Blessed One. I, too, will go there to listen to the Dharma.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བསོད་སྙོམས་དེ་བླངས་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ནས་བྱུང་ནས་དེ་ཆོས་ཐོས་པའི་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བས་ཟས་ལ་སེམས་མི་འཇུག་པར་གྱུར་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ་བདག་གིས་བསོད་སྙོམས་བླངས་ན་གང་ལ་ལོག་པར་ལྟུང་བར་མི་འགྱུར་བ་སུ་ཞིག་ལ་སྦྱིན་པར་བྱ་སྙམ་མོ།
en: Having taken up the alms, Venerable Subhūti departed from the city of Rājagṛha. Delighted and overjoyed with the Dharma teaching he had heard, he did not consider the food, but thought, “As I have taken up these alms, to whom can I offer them without it being a downfall?”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་མི་ལེན་པས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱི་སེམས་སེམས་ཀྱིས་ཤེས་ནས།
en: At that point the bodhisattva Not Grasping Any Phenomenon knew what Venerable Subhūti was thinking.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་བསོད་སྙོམས་འདི་བདག་ལ་བྱིན་ཅིག་དང་། བདག་ལ་བྱིན་ན་ལོག་པར་ལྟུང་བར་མི་འགྱུར་རོ། །སྨྲས་པ།
en: He went before him, prostrated with his head at Venerable Subhūti’s feet, and said, “Please give me these alms, honorable Subhūti. If you give them to me, it will not be a downfall.”

source: རིགས་ཀྱི་བུ་ཅི་ཁྱོད་ཚུལ་ཁྲིམས་བླངས་པའམ། ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན་ནམ། སྨྲས་པ།
en: “Noble son, are you one who has taken up discipline or one who adheres to discipline?”

source: བཙུན་པ་རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བླང་དུ་མེད་པ་སྟེ།
en: “Honorable Subhūti, there is no phenomenon that can be taken up.

source: དེ་ལ་ནི་ཚུལ་ཁྲིམས་ཀྱང་མེད།
en: Thus, there is also no discipline.

source: འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱང་མེད་དོ།
en: Nor is there faulty discipline.

source: །བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་བདག་ནི་སྲོག་གཅོད་པར་བྱེད་པ་དང་། མ་བྱིན་པར་ལེན་པ་བྱེད་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་བྱེད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་བྱེད་པ་དང་། ཕྲ་མ་བྱེད་པ་དང་། ཚིག་རྩུབ་པོ་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་སྨྲ་བ་དང་། བརྣབ་སེམས་ཅན་དང་། གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་དང་། ལོག་པར་ལྟ་བ་ཅན་ཡིན་ནོ།
en: Moreover, honorable Subhūti, I engage in killing, stealing, and sexual misconduct due to desire; I lie and speak divisively; I speak harsh words and meaningless words; and I harbor covetousness, ill will, and wrong views.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་སྙམ་དུ་སེམས་ཏེ། རིགས་ཀྱི་བུ་འདིའི་བསྟན་པ་འདི་འདྲ་བ་ལས་ན་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་ཡིན་པར་ཐེ་ཙོམ་མེད་ཀྱིས་ལྡེམ་པོ་ངག་འདི་བདག་གིས་དྲི་བར་བྱའོ་སྙམ་མོ།
en: Venerable Subhūti thought, “Since a teaching such as this one has been given by this noble son, there is no doubt that he is a bodhisattva whose progress toward awakening is irreversible.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་རིགས་ཀྱི་བུ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཅི་ལས་བསམས་ཏེ།
en: I will ask him about the meaning behind this.” So Venerable Subhūti said to the noble son, “What do you mean, noble son, when you say, ‘I engage in killing, stealing, and sexual misconduct due to desire;

source: འདི་སྐད་དུ་བདག་ནི་སྲོག་གཅོད་པ་བྱེད་པ་དང་། མ་བྱིན་པར་ལེན་པ་བྱེད་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་བྱེད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་བྱེད་པ་དང་། ཕྲ་མ་བྱེད་པ་དང་། ཚིག་རྩུབ་པོ་སྨྲ་བ་དང་། ཚིག་ཀྱལ་པ་སྨྲ་བ་དང་། བརྣབ་སེམས་ཅན་དང་། གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པ་དང་། ལོག་པར་ལྟ་བ་ཅན་ཡིན་ནོ་ཞེས་སྨྲ།
en: I lie and speak divisively; I speak harsh words and meaningless words; and I harbor covetousness, ill will, and wrong views’?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་མི་ལེན་པས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The bodhisattva Not Grasping Any Phenomenon then spoke these verses in reply:

source: བྱང་ཆུབ་ལམ་ནི་བླ་མེད་པའི། །ལམ་ནི་བདག་གིས་རྣམ་པར་སྦྱངས།
en: “I have trained in the unsurpassed path, The path of awakening.

source: །སྲོག་ཆགས་བྱེ་བ་ཕྲག་སྟོང་ཡང་།
en: I have also established billions

source: །ལམ་དེ་ལ་ནི་ཡོངས་སུ་བཀོད།
en: Of beings on this path.

source: །སྲོག་ནི་བདག་གི་ཤིན་ཏུ་གཏུགས།
en: “I destroy the individual being,

source: །དེ་ཕྱིར་བདག་ནི་དེ་སྐད་སྨྲ།
en: And it is for that reason that I speak in this way.

source: །གང་དག་ལམ་ནི་རྣམ་པར་སྦྱངས།
en: Those who are trained on the path

source: །དེ་དག་སྲོག་གཅོད་པ་ཞེས་བྱ།
en: Are known as killers

source: །ལྷས་ནི་བྱང་ཆུབ་བྱིན་མ་ཡིན།
en: “The gods do not grant awakening;

source: །བརྒྱ་བྱིན་ཚངས་པས་མ་བྱིན་ཏེ།
en: Śakra and Brahmā do not bestow it.

source: །མ་བྱིན་པར་ནི་བདག་གིས་བླངས།
en: That which was not given, I took

source: །དེ་ཕྱིར་བདག་ནི་མ་བྱིན་ལེན།
en: And thus I steal.

source: །སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར།
en: “In order to benefit all living beings,

source: །འཐུན་པའི་ཐེག་པ་བླངས་པས་ན།
en: One takes up a suitable vehicle.

source: །དེ་ཕྱིར་ཐེག་པ་ཆེན་པོ་འདི།
en: For that reason, the Great Vehicle

source: །མ་བྱིན་བླངས་ཞེས་བྱ་བ་ཡིན།
en: Has been taken without being given

source: །འདོད་པས་ལོག་པར་ཡོངས་ཤེས་པ།
en: “Fully knowing sexual misconduct

source: །ཆོས་འདོད་ཡིན་ཞེས་དེ་དག་ཤེས།
en: Is described as desiring the Dharma—this I know.

source: །འདོད་པ་འདི་དག་འདོད་མ་ཡིན།
en: Such types of desire are not desire,

source: །དེ་ཕྱིར་ལོག་ཅེས་སྤྱོད་པར་བྱེད།
en: And hence I engage in what is misconduct

source: །སྒྲར་ནི་ཇི་སྙེད་གདགས་པ་རྣམས།
en: “All words are designations

source: །དེ་དག་བརྫུན་ཞེས་ཡང་དག་གསུངས།
en: That rightly have been taught to be false.

source: །མེད་པའི་ཕྱིར་ན་དེ་བརྫུན་ཏེ།
en: Since they do not exist, they are false;

source: །བརྫུན་དུ་སྨྲ་བ་ཞེས་ཀྱང་བྱ།
en: And so, I also speak through lies . “There are those beings

source: །ཐེག་པ་དམན་པ་འདོད་པ་ཡི། །སེམས་ཅན་གང་དག་སུ་ཡང་རུང་།
en: Who long for the Lesser Vehicle;

source: །སེམས་ཅན་དེ་དག་དབྱེ་བའི་ཕྱིར།
en: In order to separate those beings from that vehicle,

source: །ཐེག་པ་ཆེ་ལ་དགོད་པར་བྱེད།
en: I establish them in the Great Vehicle.

source: །ཕྲ་མའི་ཚིག་ནི་སྨྲ་བྱེད་ཅིང་།
en: “With divisive speech I separate

source: །མུ་སྟེགས་ཅན་གཞན་འབྱེད་པར་བྱེད།
en: Others who are tīrthikas.

source: །སེམས་ཅན་ལམ་ངན་ལྷུང་བ་རྣམས།
en: Those who have strayed onto negative paths

source: །ཡང་དག་ལམ་ལ་འཛུད་པར་བྱེད།
en: I establish on the genuine path.

source: །རྒོལ་བ་དེ་དག་ཚར་བཅད་དེ།
en: “I have defeated adversaries,

source: །དེ་དག་ཤིན་ཏུ་དགའ་བ་མེད།
en: And they do not like it in the least.

source: །རྩུབ་པའི་ཚིག་ནི་སྨྲས་ནས་ཀྱང་།
en: Through speaking harsh words,

source: །བདུད་རྣམས་ཐམས་ཅད་ཕམ་པར་བྱས།
en: I have conquered all demons.

source: །རྩུབ་པའི་ཚིག་ནི་སྨྲ་མོད་ཀྱི།
en: “I speak harsh words,

source: །འོན་ཀྱང་སེམས་ལ་ཁྲོ་བ་མེད།
en: Yet my mind is without wrath.

source: །སེམས་ཅན་སྨིན་པར་བྱ་བ་ལ།
en: In order to bring beings to maturity

source: །དཔའ་བོ་རྣམས་ཀྱིས་ཐབས་ལ་ལྟོས།
en: I apply the methods of heroic beings.

source: །གང་ལས་དགོངས་ཏེ་གསུངས་པ་ཡི།
en: “I have understood words

source: །དགོངས་པའི་ཚིག་ནི་རབ་ཏུ་ཤེས།
en: And the intention behind those words.

source: །དེས་ན་བསམས་ཏེ་རབ་སྨྲ་ཞིང་།
en: Thus, with this in mind, I speak comprehensively,

source: །སེམས་ཅན་བྱེ་བ་འདུལ་བར་བྱེད།
en: And tame millions of beings.

source: །ཁ་ཅིག་ལ་ནི་བསམས་ཏེ་སྨྲས།
en: “To some I speak with consideration,

source: །ཁ་ཅིག་དེ་དག་བརྫུན་པར་ཤེས།
en: Yet some perceive it as lies.

source: །དེ་ཕྱིར་བསམས་ཏེ་སྨྲ་བ་ཡིན།
en: Thus, as I speak with consideration,

source: །ཆོས་ཀྱི་མངོན་སུམ་རྟོགས་པར་བྱེད།
en: I elicit direct understanding of the Dharma.

source: །སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་རྣམས།
en: “All beings without exception,

source: །རེ་རེ་ལ་ཡང་དེ་དག་ནི།
en: Each and every one of them, Experience covetousness and crave

source: །མི་མིན་ལྷ་ཡི་བདེ་བ་དག །འཇིག་རྟེན་ན་ནི་བརྣབ་སེམས་བྱེད།
en: The pleasures of the nonhuman gods in the world.

source: །བདེ་བ་གང་དག་ལྡན་གྱུར་ན།
en: “Whoever possesses this pleasure

source: །འཇིག་རྟེན་མགོན་པོ་ཕན་བྱེད་འགྱུར། །བདེ་བ་དེ་ནི་སེམས་ཅན་ཀུན།
en: Becomes a benevolent guardian of the world.

source: །ལྡན་པར་མཁས་རྣམས་བརྣབ་སེམས་བྱེད།
en: Thus, wise ones are covetous in wishing That all beings may have such happiness.

source: །སེམས་ཅན་ཐམས་ཅད་རྒྱལ་གྱུར་ཅེས།
en: “Saying ‘May all beings be victorious!’

source: །རྟག་ཏུ་དེ་དག་བརྣབ་སེམས་བྱེད།
en: Wise beings are perpetually covetous.

source: །བརྣབ་སེམས་དེ་འདྲ་ཡིན་པས་ན།
en: Since covetousness is like that,

source: །དེ་ཕྱིར་བརྣབ་སེམས་ཅན་ཞེས་སྨྲས།
en: I also claim to be covetous

source: །དམ་པའི་ཆོས་ནི་འཇིག་པའི་ཚེ།
en: “At the time when the sacred Dharma is perishing,

source: །སྟོབས་ཆེན་རྣམས་ཀྱིས་ཚར་བཅད་དེ།
en: Mighty beings put an end to that decline.

source: །དེ་དག་རང་གི་བདེ་བ་སྤོང་།
en: They forgo their own happiness,

source: །ཆོས་དང་སྲོག་ཆགས་སྤོང་མི་བྱེད།
en: And do not abandon the Dharma, nor living beings. “There are those who display ill will In order to bring into harmony

source: །འཇིག་རྟེན་ཀུན་གྱི་རྒོལ་བ་དང་། སེམས་ཅན་ཀུན་དང་མི་འཐུན་ཏེ། །ཐམས་ཅད་འཐུན་པར་བྱ་བའི་ཕྱིར། །དེ་དག་གནོད་སེམས་སྟོན་པར་བྱེད།
en: All fighting in the world And all disagreement among beings.

source: །དེ་དག་བསྐལ་པར་རྩོད་བྱེད་དམ།
en: “If one were to quarrel with them for an eon,

source: །བསྐལ་པ་བྱེ་བར་རྩོད་ཀྱང་རུང་།
en: Or even for millions of eons,

source: །དམ་པའི་ཆོས་ནི་སྤོང་མི་བྱེད།
en: They would not abandon the sacred Dharma,

source: །སླར་ཡང་ལྡོག་པར་ཡོངས་མི་བྱེད།
en: Nor turn their back in any way.

source: །ལོག་པར་ལྟ་ལ་དཔའ་བ་རྣམས།
en: “Those who are brave with respect to wrong views

source: །དེ་དག་འདུས་བྱས་ཀུན་ལ་སྙོམས།
en: Are equanimous toward everything conditioned.

source: །ལོག་པར་ལྟ་བ་རབ་ཏུ་ཤེས།
en: They understand wrong views,

source: །ཡང་དག་ལྟ་བའི་རྣམ་པར་རྟོག །གང་དག་དེ་འདྲའི་ཆོས་དང་ལྡན།
en: And comprehend authentic views. “Whoever possesses such qualities

source: །དེ་དང་དེ་དག་ཁྲིམས་ལ་གནས།
en: Adheres to a variety of disciplines.

source: །གནས་མེད་ལ་ནི་གནས་བཅས་ནས།
en: Adhering where there is nothing to adhere to,

source: །མཁས་རྣམས་བྱང་ཆུབ་རྟོགས་པར་འགྱུར།
en: Wise ones realize awakening.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་རིགས་ཀྱི་བུ་དེ་ལ་བསོད་སྙོམས་དེ་བྱིན་ནས་འདི་སྐད་དུ་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་དག་གིས་ནི་དད་པས་བྱིན་པའི་བསོད་སྙོམས་ལོག་པར་ལྟུང་བར་མི་བྱེད་དོ་ཞེས་སྨྲས་སོ།
en: Thereupon, Venerable Subhūti offered the alms to that noble son, saying, “Such holy beings do not cause downfalls through alms offered with faith.” Thus, Venerable Subhūti did not eat.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཟན་མ་ཟོས་ཏེ་ཕྱེམ་རེད་ཀྱི་དུས་ན་ནང་དུ་ཡང་དག་འཇོག་ལས་ལངས་ནས།
en: In the afternoon, he rose from his inner absorption and went before the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཇི་ལྟར་གྱུར་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: He prostrated with his head at the Blessed One’s feet and then recounted to the Blessed One all that had happened.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་དེ་སུ་ཡིན་པ་ཤེས་སམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མ་འཚལ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “Subhūti, do you know who that bodhisattva was?” asked the Blessed One. “Blessed One, I do not know.”

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བུད་མེད་འགྱུར་བ་ཞེས་བྱ་སྟེ་དགའ་བ་བཀོད་པའི་ཐབས་ལ་མཁས་པས་སེམས་ཅན་རྣམས་འདུལ་བར་བྱེད་དོ།
en: “Subhūti, that bodhisattva great being is called Strīvivarta. She tames beings by skillfully bringing them pleasure.

source: །རབ་འབྱོར་དཔེར་ན་ཡུངས་འབྲུས་ཤིང་རྟ་བཀང་བ་ལ་ཡུལ་མ་ག་དྷཱའི་ཁལ་བཅུ་ཚད་ཉི་ཤུ་ཡོད་པ་ལས་ལོ་བརྒྱ་ཞིང་ཡུངས་འབྲུ་རེ་རེ་བོར་བ་ནི་བགྲང་བ་དེ་ལྟ་བུའི་ཚུལ་གྱིས་ཤིང་རྟ་དེའི་ཡུངས་འབྲུའི་མཐའ་ཆེས་མྱུར་དུ་རྟོགས་པར་ནུས་ཀྱི།
en: To give an analogy, Subhūti, consider a chariot filled with two hundred Magadha bushels of mustard seeds. Now, if every hundred years one were to remove a single mustard seed from that chariot, one would soon determine how many mustard seeds fit in such a chariot.

source: བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བས་དགའ་བ་བཀོད་པའི་ཐབས་ལ་མཁས་པས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་སེམས་ཅན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སེམས་ཅན་མང་པོ་ལྷ་དང་མིར་སྐྱེ་བ་ལ་བཀོད་པ་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ།
en: However, that is not the case for the beings in this Sahā world system whom the bodhisattva Strīvivarta has brought to maturity in unsurpassed and perfect awakening by skillfully bringing them pleasure; nor is it the case for the many beings she has established in births as gods or humans.”

source: །དེ་ནས་བུད་མེད་དེ་བུད་མེད་ལྔ་བརྒྱས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Then the lady, with five hundred women surrounding and preceding her, left the city of Rājagṛha and went before the Blessed One at Vulture Peak Mountain.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བུད་མེད་དེ་འོང་བ་ཐག་རིང་པོ་ནས་གཟིགས་ཏེ། གཟིགས་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་བུད་མེད་ལྔ་བརྒྱ་ཙམ་འོང་བ་འདི་དག་མཐོང་ངམ། གསོལ་པ།
en: The Blessed One saw at a great distance that the lady was approaching, and he asked Venerable Subhūti, “Subhūti, do you see these five hundred women that are coming this way?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “I see them, Blessed One.”

source: འདི་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་བུད་མེད་འགྱུར་བས་དགའ་བ་བཀོད་པའི་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བཀོད་པ་ཤ་སྟག་གོ།
en: “The bodhisattva Strīvivarta has brought every single one of them to maturity and established them in unsurpassable and perfect awakening by skillfully bringing them pleasure.”

source: །དེ་ནས་བུད་མེད་དེ་བུད་མེད་ལྔ་བརྒྱས་བསྐོར་ཅིང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Strīvivarta, surrounded by the five hundred women, went before the Blessed One.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བུད་མེད་དེ་བསུ་ནས་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་བྱས་སོ།
en: Venerable Subhūti greeted the lady, joining his palms and paying homage.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འཕགས་པའི་ཆོས་མ་ཐོབ་པ་དང་། འཕགས་པའི་ལུས་སུ་མི་གནས་པའི་བུད་མེད་ལ་ཅིའི་ཕྱིར་ཕྱག་འཚལ།
en: Then Venerable Śāriputra asked Venerable Subhūti, “Venerable Subhūti, why are you paying homage to a woman who has neither the qualities nor the body of a noble one?”

source: བུད་མེད་དེས་སྨྲས་པ། གནས་བརྟན་ཤཱ་རིའི་བུ་གལ་ཏེ་འཇིག་རྟེན་ན་འཕགས་པ་ནི་གང་དག་ལགས། འཕགས་པ་མ་ལགས་པ་ནི་གང་དག་ལགས་པ་མཁྱེན་ན་ཁྱོད་ཀྱིས་སྤོབས་པ་མཛོད་ཅིག །གནས་བརྟན་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: “Elder Śāriputra,” responded the lady, “if you know who in this world is a noble being and who is not, please do tell us.”

source: ཆེ་ཞེ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་ན་འཕགས་པ་གང་དག་ཡིན་པ་དང་། འཕགས་པ་མ་ཡིན་པ་གང་དག་ཡིན་པ་ཤེས་སམ།
en: “Elder sister,” said elder Śāriputra, “do you know who in this world is a noble being and who is not?”

source: སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བདག་གིས་འཚལ་ཏོ།
en: “Yes, honorable Śāriputra, I do.”

source: །སྨྲས་པ་དེ་དག་གང་ཡིན།
en: “Which ones are they?”

source: སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་འཕགས་པའི་རིགས་མི་གཅོད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཕགས་པའོ།
en: “Those who do not sever the lineage of the noble ones, honorable Śāriputra, are noble beings.

source: །སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་རིགས་མི་གཅོད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཕགས་པའོ།
en: Those who do not sever the lineages of the Buddha, Dharma, and Saṅgha are noble beings.

source: །འཕགས་པ་རྣམས་ལ་བྱམས་པའི་སེམས་དང་ལྡན་པ་དང་། འཕགས་པ་མ་ཡིན་པ་རྣམས་ལ་ཐར་བ་འདོད་པ་གང་དག་ལགས་པ་དེ་དག་ནི་འཕགས་པའོ།
en: Noble beings are those who love other noble beings and seek liberation for those who are not noble beings.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་བུད་མེད་རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་པ། གོས་གཙང་མ་སྲབ་མོ་གྱོན་པ། ཕྱེ་མ་དང་། སྤོས་དང་། མེ་ཏོག་ཕྲེང་དང་། བྱུག་པ་རྣམས་ལ་སྟེན་པ། འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བ་ནི་ཆེས་སླའི་དགྲ་བཅོམ་པ་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་དབེན་པ་ན་གནས་པ་ནི་དེ་ལྟ་མ་ལགས་སོ།
en: Moreover, honorable Śāriputra, a woman—elegantly adorned with jewelry, dressed in fine, immaculate clothes, beautified by powders, fragrances, flower garlands, and lotions, and pleasing to the five senses—whose mind is not divorced from the state of omniscience is far preferable to a worthy one who remains isolated and engages in concentration on the eight liberations.

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གཞན་ཡང་དོན་འདི་ཉིད་བརྡ་སྤྲད་པའི་ཕྱིར་ཁྱོད་ལ་དཔེ་བསྟན་པར་བགྱི་ན་བཙུན་པ་ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་དགོངས།
en: Honorable Śāriputra, in order to communicate this very meaning, I will give you an analogy.

source: མཆིང་བུའི་ནོར་བུ་བཻ་དཱུརྱའི་སྣོད་དུ་བཅུག་པ་འདམ་མམ།
en: Now tell me, honorable Śāriputra, would you put a trinket in a container of beryl?

source: འོན་ཏེ་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་འདམ་རྫབ་ཏུ་བཅུག་པ་འདམ།
en: Or would you put a priceless jewel in a cesspit?”

source: གནས་བརྟན་ཤཱ་རིའི་བུས་སྨྲས་པ། ཆེ་ཞེ་ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་འདམ་རྫབ་ཏུ་བཅུག་པ་འདམ་གྱི་མཆིང་བུའི་ནོར་བུ་བཻ་དཱུརྱའི་སྣོད་དུ་བཅུག་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །སྨྲས་པ།
en: “Elder sister,” replied elder Śāriputra, “neither would I put a priceless jewel in a cesspit, nor would I put a trinket in a container of beryl.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་བུད་མེད་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ལྡན་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བ་ནི་ཆེས་འཕགས་ཀྱི། དགྲ་བཅོམ་པ་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ་དབེན་པ་ན་གནས་པ་དེ་ནི་དེ་ལྟ་མ་ལགས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ།
en: “Likewise, honorable Śāriputra, a woman who is pleasing to the five senses and whose mind is not divorced from the state of omniscience is far superior to a worthy one who remains isolated and engages in concentration on the eight liberations.”

source: ཆེ་ཞེ་ཁྱོད་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནམ། སྨྲས་པ།
en: “Elder sister,” asked Venerable Śāriputra, “have you truly entered into the Great Vehicle?”

source: བཙུན་པ་ཤཱ་རིའི་བུ་ཐེག་པ་ཆེན་པོ་ནི་གང་ལ་ཡང་མི་གནས་ལ་ལྡོག་པ་ཡང་མ་མཆིས་སོ། །སྨྲས་པ།
en: “Honorable Śāriputra, in the Great Vehicle there is nowhere at all to be, nor is there anything to withdraw from.”
